Labs/Registration/app/helpers/session_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def current_user
        @_current_user ||= session[:current_user_id] &&
        User.find_by_id(session[:current_user_id])